using Ship.Model.Db;
using System;
using System.Collections.Generic;
using System.Linq;
using Ship.Model.Extension;
using Ship.Model.ViewModel.Site;

namespace Ship.Model.BLL.Site
{
    public class SiteBLL
    {
        public static int Subscribe(string Email)
        {
            try
            {
                Email = Email.ToEnNum();

                using (var x = new GolatehEntities())
                {
                    if (x.Subscribe.AsNoTracking().Any(v => v.Email.Trim().ToLower() == Email.Trim().ToLower()) == false)
                    {
                        x.Subscribe.Add(new Subscribe() { Email = Email.Trim().ToLower(), CreateDate = System.DateTime.Now });

                        x.SaveChanges();
                        return 1;
                    }
                    else
                    {
                        return 1;
                    }
                }
            }
            catch (Exception e)
            {
                return 0;
            }
        }
        public static List<MessageTitlePage> Emkanat()
        {
            List<MessageTitlePage> lst = new List<MessageTitlePage>
            {
                new MessageTitlePage()
                {
                    Body = @"گفته می شود که نمک های دریایی با کیفیت بالا به طور معمول حاوی بیش از ۶۰ مواد معدنی هستند. به طور کلی می توانیم بگوییم که نمک دریایی منبع بسیار خوبی برای دریافت مواد مغذی هستند.
به دلیل کمبود خاک غنی از مواد مغذی، روز به روز دریافت مواد مغذی از غذاهایی که می خوریم سخت تر و سخت تر می شود. بااین حال این مواد مغذی هنوز هم در دریاها و اقیانوس ها به مقدار زیاد موجود هستند، که از طریق انواع نمک دریایی میتوانیم به آنها دست یابیم.
",
                    Title = "سرشار از مواد معدنی کمیاب"
                },
                new MessageTitlePage()
                {
                    Body = @"در اینجا نحوه کار سدیم در داخل بدن را شرح می دهیم: آب نمک را دنبال می کند، به این معنی که اگر شما مقدار سدیم را افزایش دهید، حفظ آب نیز اتفاق می افتد. در عین حال مخالف این روند هم صادق است: از دست دادن سدیم موجب از دست دادن آب نیز می شود، که این به طور بلقوه باعث ایجاد علایمی نظیر کم آبی و تسنگی مفرط می شود.
با مصرف مقدار معتدل نمک دریایی، می توانید مطمئن شوید که میزان سدیم کافی که به متعادل کردن نسبت های سدیم – پتاسیم کمک می کند، را حفظ می کنید. سدیم و پتاسیم دو الکترولیت هستند که با یکدیگر کار می کنند تا اطمینان حاصل شود که تعادل مایع موجود در سلول های بدن و همچنین پلاسمای خون و مایع خارج سلولی وجود دارد.
",
                    Title = "جلوگیری از کم آبی بدن و تعادل مایعات"
                },
                new MessageTitlePage()
                {
                    Body = @"حداقل پردازش نمک دریایی تصفیه نشده، آن را قادر می ‌سازد تا بخش اعظم مواد معدنی طبیعی خود را حفظ کند. نمک دریایی شامل بسیاری از الکترولیت مهم نظیر سدیم، منیزیم، کلسیم و پتاسیم است که برای سلامت ضروری هستند.
الکترولیت ها وظایف مهم زیادی دارند – از منظم کردن ضربان قلب شما تا دادن اجازه دادن به ماهیچه ‌ها برای منقبض شدن به طوری که شما بتوانید حرکت کنید. نمک دریایی می تواند به پیشگیری از عدم تعادل الکترولیت هایی که می توانند منجر به بروز هر نوع علایم منفی جدی کشنده شوند، کمک کند
",
                    Title = "بارگیری شده با الکترولیت ها"
                },
                new MessageTitlePage()
                {
                    Body = @"به عنوان یک منبع خوب از سدیم، نمک دریایی برای عملکرد مناسب مغز، ماهیچه و سیستم عصبی ضروری است. سدیم نه تنها در تنظیم تعادل مایعات بدن شما نقش مهمی ایفا می ‌کند، بلکه برای انتقال سیگنال ‌های الکتریکی در بدن نیز لازم است. چرا این موضوع اینقدر مهم است؟ چون بدون انتقال مناسب سیگنال های الکتریکی در بدن، چیزهای زیادی می توانند از بین بروند
بدون این سیستم ارتباطی مغز، ماهیچه ها و سیستم عصبی نمی توانند به درستی کار کنند. همانطور که مصرف کم سدیم بدن را با مشکل مواجه می کند، افراط در مصرف آن نیز می تواند باعث مشکلات و ناراحتی های سلولی شود. پس مراقب مصرف نمک رژیم غذایی تان باشید.
",
                    Title = "بهبود عملکرد مغز، ماهیچه و سیستم عصبی"
                },
                new MessageTitlePage()
                {
                    Body = @"دریافت نمک به مقدار ناکافی در رژیم غذایی شما می ‌تواند بر سلامت گوارش شما تاثیر منفی بگذارد. در حقیقت، فقدان نمک در رژیم غذایی می‌ تواند منجر به کاهش اسید هیدروکلریک ( HCL ) در معده شما شود. اگر شما با مشکل کمبود اسید معده مواجه هستید، نمک دریایی می ‌تواند به مسائلی مانند سوزش معده، درد معده، استفراغ و یبوست کمک کند.
مصرف مقدار صحیح نمک دریایی می‌ تواند به بدن شما کمک کند تا مقادیر مناسب HCL را تولید کند چون نمک دریا کلرید ایجاد می ‌کند، که یکی از بلوک‌ های سازنده اسید معده است
",
                    Title = "حمایت از سلامت گوارشی"
                },
                new MessageTitlePage()
                {
                    Body = @"داشتن اسید معده به اندازه کافی، به بدن ما کمک می‌ کند که ویتامین و مواد معدنی نظیر کلسیم، روی، آهن، اسید فولیک و ویتامین b12 را جذب کند. به همین دلیل، مصرف نمک دریایی با کیفیت بالا به طور منظم می ‌تواند به بدن شما کمک کند تا مواد غذایی بیشتری را از غذاهایی که می‌ خورید ، جذب کند.",
                    Title = "افزایش جذب مواد مغذی"
                },
                new MessageTitlePage()
                {
                    Body = @"قرن هاست که در بسیاری از اشکال طب سنتی، نمک دریایی یکی از عناصر تشکیل ‌دهنده این صنعت بوده ‌است. در واقع، متون آئورودای باستانی حتی نام نمک دریایی را ذکر کرده و آن را برای عملکرد و رشد بدن ضروری دانسته اند.
                    به گفته آیورودا نمک باید تصفیه نشده باشد تا بتواند بیش ترین فایده های سلامتی را برایتان فراهم کند. اعتقاد بر این است که نمک دریایی به عنوان ضد دیورتیک عمل می کند و به تسکین گلو و تمیز کردن سینوس‌ ها کمک می‌ کند، تعادل الکترولیت را تامین می ‌کند و به سم زدایی بدن نیز کمک می ‌کند.
                    در همین حال، در طب سنتی چین، نمک دریایی برای خنک کردن بدن و تنظیم سطح آب و رطوبت به کار می ‌رود. هم چنین گفته می ‌شود که سلامت کلیه را افزایش داده، سموم دفع کرده و هضم درست را در بدن ترویج می ‌کند.
                    ",
                    Title = "غنی از مواد معدنی"
                }
            };

            return lst;
        }
        public static int SendContactUs(string FullName, string Email, string Subject, string Message)
        {
            try
            {
                Email = Email.ToEnNum();

                using (var x = new GolatehEntities())
                {
                    x.ContactUs.Add(new ContactUs()
                    {
                        Email = Email.Trim().ToLower(),
                        CreateDate = System.DateTime.Now,
                        FullName = FullName,
                        Message = Message,
                        Title = "-"
                    });

                    x.SaveChanges();
                    return 1;
                }
            }
            catch (Exception e)
            {
                return 0;
            }
        }
    }
}